nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1170/azure_rtos_examples/azure_iot_embedded_sdk_adu/cm7/nx_driver_imxrt.c
      /*make sure transmit BD buffer 8byte aligment*/
      packet_ptr->nx_packet_prepend_ptr -= remainder;

      memmove(packet_ptr->nx_packet_prepend_ptr,src_addr,nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].length);
    }

    /* Find the Buffer, set the Buffer pointer. */
    nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].buffer = (uint32_t)(packet_ptr->nx_packet_prepend_ptr - 2);

    /* Clear the first Descriptor's LS bit.  */
    nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].control &= ~ENET_BUFFDESCRIPTOR_TX_LAST_MASK;

    /* Find next packet.  */
    for (pktIdx = packet_ptr -> nx_packet_next;
         pktIdx != NX_NULL;
         pktIdx = pktIdx -> nx_packet_next)
    {

        /* Move to next descriptor.  */
        curIdx = (curIdx + 1) & (NX_DRIVER_TX_DESCRIPTORS - 1);

        /* Check if it is a free descriptor.  */
        if ((nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].control & ENET_BUFFDESCRIPTOR_TX_READY_MASK) || nx_driver_information.nx_driver_information_transmit_packets[curIdx])
        {

            /* No more descriptor available, return driver error status.  */
            return(NX_DRIVER_ERROR);
        }


        /* Find the Buffer, set the Buffer pointer.  */
        nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].buffer = (uint32_t)(pktIdx->nx_packet_prepend_ptr);

        /* Set the buffer size.  */
        nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].length = (pktIdx -> nx_packet_append_ptr - pktIdx->nx_packet_prepend_ptr);

        /* Clear the descriptor's LS bit.  */
        nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].control &= ~ENET_BUFFDESCRIPTOR_TX_LAST_MASK;

        /* Increment the BD count.  */
        bd_count++;

    }

    /* Set the last Descriptor's LS & IC & OWN bit.  */
    nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].control |= (ENET_BUFFDESCRIPTOR_TX_LAST_MASK | ENET_BUFFDESCRIPTOR_TX_READY_MASK);

    /* Save the pkt pointer to release.  */
    nx_driver_information.nx_driver_information_transmit_packets[curIdx] = packet_ptr;

    /* Set the current index to the next descriptor.  */
    nx_driver_information.nx_driver_information_transmit_current_index = (curIdx + 1) & (NX_DRIVER_TX_DESCRIPTORS - 1);

    /* Increment the transmit buffers in use count.  */
    nx_driver_information.nx_driver_information_number_of_transmit_buffers_in_use += bd_count + 1;

    /* Set OWN bit to indicate BDs are ready.  */
    for (; bd_count > 0; bd_count--)
    {

        /* Set OWN bit in reverse order, move to prevous BD.  */
        curIdx = (curIdx - 1) & (NX_DRIVER_TX_DESCRIPTORS - 1);

        /* Set this BD's OWN bit.  */
        nx_driver_information.nx_driver_information_dma_tx_descriptors[curIdx].control |= ENET_BUFFDESCRIPTOR_TX_READY_MASK;
    }

    /* If the DMA transmission is suspended, resume transmission.  */
    if (!EXAMPLE_ENET->TDAR)
    {

        /* Resume DMA transmission. */
        EXAMPLE_ENET->TDAR = ENET_TDAR_TDAR_MASK;
    }

    return(NX_SUCCESS);
}


/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*    nx_crc32()                                         PORTABLE C       */
/*                                                           1.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    SK - Microsoft Corporation                                          */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    Calculate 32bit CRC using reversed Poly for Ethernet.               */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    UCHAR dbuf[]  - pointer to the data buffer.                         */
/*    INT length    - Length of the data                                  */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    CRC value                                                           */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    _nx_driver_hardware_multicast_join                                  */
/*    _nx_driver_hardware_multicast_leave                                 */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  03-09-2007           SK                    Initial Version 1.0        */
/*                                                                        */
/**************************************************************************/
static ULONG  nx_crc32(UCHAR dbuf[], INT length)
{

INT             i;
INT             bit;
ULONG           crc  = 0xFFFFFFFFUL;
ULONG           poly = 0xEDB88320UL;
ULONG           p;
ULONG           data;


    for (i = 0; i < length; i++)
    {
        data = ((ULONG)dbuf[i]);

        for (bit = 0; bit < 8; bit++)
        {
            p   = (crc ^ ((ULONG)data)) & 1UL;
            crc >>= 1;
            if (p != 0)
                crc ^= poly;
            data >>= 1;
        }
    }

