nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1170/azure_rtos_examples/azure_iot_embedded_sdk_adu/cm7/nx_driver_imxrt.c
            bd_count = 0;

        }
        else
        {

            /* This BD is not the last BD of a frame. It is a intermediate descriptor.  */

            nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_next = nx_driver_information.nx_driver_information_receive_packets[(idx + 1) & (NX_DRIVER_RX_DESCRIPTORS - 1)];

            nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_append_ptr = nx_driver_information.nx_driver_information_receive_packets[idx] -> nx_packet_data_end;

            bd_count++;
        }
    }

    /* If Rx DMA is in suspended state, resume it.  */
    if (!EXAMPLE_ENET->RDAR)
    {

        /* Resume DMA reception */
        EXAMPLE_ENET->RDAR = ENET_RDAR_RDAR_MASK;
    }

}

/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_driver_link_mode_changed                         PORTABLE C      */
/*                                                           5.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function changes the link mode of the Ethernet.                */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    enet_duplex                           Set duplex mode               */
/*    nx_packet_transmit_release            Release the packet            */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    nx_driver_ethernet_phy_isr                                          */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  02-01-2018     Yuxin Zhou               Initial Version 5.0           */
/*                                                                        */
/**************************************************************************/
VOID  nx_driver_link_mode_changed(VOID)
{

ULONG numOfBuf;
ULONG idx;


    /* Stop the Ethernet.  */
    EXAMPLE_ENET->ECR &= ~ENET_ECR_ETHEREN_MASK;

    /* Set speed for RMII mode.  */
    if (nx_driver_information.nx_driver_information_link_speed == kENET_MiiSpeed10M)
    {

        EXAMPLE_ENET->RCR |= ENET_RCR_RMII_10T_MASK;
    }
    else
    {

        EXAMPLE_ENET->RCR &= ~ENET_RCR_RMII_10T_MASK;
    }

    /* Set duplex mode.  */
    /* Set the duplex on the selected FEC controller*/
    switch (nx_driver_information.nx_driver_information_link_duplex)
    {
        case kENET_MiiHalfDuplex:
            EXAMPLE_ENET->RCR/*(ch)*/ |= ENET_RCR_DRT_MASK;
            EXAMPLE_ENET->TCR/*(ch)*/ &= (uint32_t)~ENET_TCR_FDEN_MASK;
            break;
        case kENET_MiiFullDuplex:
        default:
            EXAMPLE_ENET->RCR/*(ch)*/ &= ~ENET_RCR_DRT_MASK;
            EXAMPLE_ENET->TCR/*(ch)*/ |= ENET_TCR_FDEN_MASK;
            break;
    }

    if (nx_driver_information.nx_driver_information_state >= NX_DRIVER_STATE_INITIALIZED)
    {

        numOfBuf = nx_driver_information.nx_driver_information_number_of_transmit_buffers_in_use;
        idx =      nx_driver_information.nx_driver_information_transmit_release_index;

        /* Reset indices.  */
        nx_driver_information.nx_driver_information_receive_current_index = 0;
        nx_driver_information.nx_driver_information_transmit_current_index = 0;
        nx_driver_information.nx_driver_information_transmit_release_index = 0;
        nx_driver_information.nx_driver_information_number_of_transmit_buffers_in_use = 0;

        /* Release transmit packets if any.  */
        while (numOfBuf--)
        {

            /* If no packet, just examine the next packet.  */
            if (nx_driver_information.nx_driver_information_transmit_packets[idx] == NX_NULL)
            {

                /* No packet in use, skip to next.  */
                idx = (idx + 1) & (NX_DRIVER_TX_DESCRIPTORS - 1);
                continue;
            }

            /* Remove the Ethernet header and release the packet.  */
            NX_DRIVER_ETHERNET_HEADER_REMOVE(nx_driver_information.nx_driver_information_transmit_packets[idx]);

            /* Release the packet.  */
            nx_packet_transmit_release(nx_driver_information.nx_driver_information_transmit_packets[idx]);
        }

        /* Free receive descriptors.  */
        for (idx = 0; idx < NX_DRIVER_RX_DESCRIPTORS; idx++)
        {

            nx_driver_information.nx_driver_information_dma_rx_descriptors[idx].control |= ENET_BUFFDESCRIPTOR_RX_EMPTY_MASK;
        }
    }

    /* Set Transmit Descriptor List Address Register */
    EXAMPLE_ENET->TDSR = (ULONG) nx_driver_information.nx_driver_information_dma_tx_descriptors;

