nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1170/azure_rtos_examples/azure_iot_embedded_sdk_adu/cm7/nx_driver_imxrt.c
    /* Configure the Receive Buffer Size Register.  */
    EXAMPLE_ENET->MRBR = nx_driver_information.nx_driver_information_rx_buffer_size;

    /* Set Receive Descriptor List Address Register.  */
    EXAMPLE_ENET->RDSR = (ULONG) nx_driver_information.nx_driver_information_dma_rx_descriptors;

    if (nx_driver_information.nx_driver_information_state >= NX_DRIVER_STATE_LINK_ENABLED)
    {

        /* Enable ethernet & start packet receiving.  */
        EXAMPLE_ENET->ECR |= ENET_ECR_ETHEREN_MASK;
        EXAMPLE_ENET->RDAR = ENET_RDAR_RDAR_MASK;
    }
}

/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    nx_driver_imx_ethernet_isr                          PORTABLE C      */
/*                                                           5.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function processing incoming packets.  This routine is         */
/*    be called from the receive packet ISR and assumes that the          */
/*    interrupt is saved/restored around the call by ThreadX.             */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    _nx_ip_driver_deferred_processing     IP receive packet processing  */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    ISR                                                                 */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  02-01-2018     Yuxin Zhou               Initial Version 5.0           */
/*                                                                        */
/**************************************************************************/
VOID  nx_driver_imx_ethernet_isr(VOID)
{
  UINT status;
  status = EXAMPLE_ENET->EIR;

  if(status & ENET_EIR_RXF_MASK )
  {
    /* Receive packet interrupt.  */
#ifdef NX_DRIVER_ENABLE_DEFERRED

    /* Set the receive packet interrupt.  */
    nx_driver_information.nx_driver_information_deferred_events |= NX_DRIVER_DEFERRED_PACKET_RECEIVED;
#else

    /* Process received packet(s).  */
    _nx_driver_hardware_packet_received();
#endif


#ifdef NX_DRIVER_ENABLE_DEFERRED

    /* Call NetX deferred driver processing.  */
    _nx_ip_driver_deferred_processing(nx_driver_information.nx_driver_information_ip_ptr);
#endif

    /* Clear the Ethernet DMA Rx IT pending bits */
    EXAMPLE_ENET->EIR = ENET_EIR_RXF_MASK;
  }
  if(status & ENET_EIR_TXF_MASK)
  {

     EXAMPLE_ENET->TDAR = ENET_TDAR_TDAR_MASK;

#ifdef NX_DRIVER_ENABLE_DEFERRED

    /* Set the transmit complete bit.  */
    nx_driver_information.nx_driver_information_deferred_events |= NX_DRIVER_DEFERRED_PACKET_TRANSMITTED;
#else

    /* Process transmitted packet(s).  */
    _nx_driver_hardware_packet_transmitted();
#endif

#ifdef NX_DRIVER_ENABLE_DEFERRED

    /* Call NetX deferred driver processing.  */
    _nx_ip_driver_deferred_processing(nx_driver_information.nx_driver_information_ip_ptr);
#endif

    /* Clear the Eth DMA Tx IT pending bit.  */
    EXAMPLE_ENET->EIR = ENET_EIR_TXF_MASK;
  }
}

/****** DRIVER SPECIFIC ****** Start of part/vendor specific internal driver functions.  */
